hidirektor/ondergrup-stm32/v2.0-IoT/Core/Src/main.c
		if((kapiTablaAcKonum==1 || kapiTablaAcKonum==2)
				&& (HAL_GPIO_ReadPin(ustLimitIn_GPIO_Port, ustLimitIn_Pin)==1)
				&&(HAL_GPIO_ReadPin(altLimitIn_GPIO_Port, altLimitIn_Pin)==0)) {
			kapiTablaAcKonumKat2=1;
		} else {
			kapiTablaAcKonumKat2=0;
		}

		if(kapiTablaAcKonumKat1==1
				&& kapiAcTipi==1
				&& HAL_GPIO_ReadPin(asagiStartIn_GPIO_Port, asagiStartIn_Pin)==0) {
			kapiactablaesp1=1;
		} else {
			kapiactablaesp1=0;
		}

		if(kapiTablaAcKonumKat2==1
				&& kapiAcTipi==1
				&& HAL_GPIO_ReadPin(yukariStartIn_GPIO_Port, yukariStartIn_Pin)==0) {
			kapiactablaesp2=1;
		} else {
			kapiactablaesp2=0;
		}

		// tabla kapısı prudhome

		if((kapitablaTip==0)&&((kapiSecimleri==2)||(kapiSecimleri==3))
				&&((kapiTablaAcKonumKat1==1)||(kapiTablaAcKonumKat2==1))
				&&(((HAL_GPIO_ReadPin(kapiTablaAcButonIn_GPIO_Port, kapiTablaAcButonIn_Pin)==0)&&(kapiAcTipi==0))
				||(kapiactablaesp1)==1 || (kapiactablaesp2)==1)
				&&(makineStop==1)
				&&(butonKontrol==0)) {

			kapiTablaprudhome=1;
			timer = millis;
			bekle();
		}

		if((millis-timer >= kapiTablaAcSure)||((kapiTablaAcKonumKat1==0)&&(kapiTablaAcKonumKat2==0))||(makineStop==0)) {
			kapiTablaprudhome=0;
		}

		// tabla kapı buton kontrol

		if((kapitablaTip==1)&&((kapiSecimleri==2)||(kapiSecimleri==3))

				&&((kapiTablaAcKonumKat1==1)||(kapiTablaAcKonumKat2==1))
				&&(((HAL_GPIO_ReadPin(kapiTablaAcButonIn_GPIO_Port, kapiTablaAcButonIn_Pin)==0)&&(kapiAcTipi==0))
				||(kapiactablaesp1)==1 || (kapiactablaesp2)==1)
				&&(makineStop==1)) {
			kapiTablabutonkontrol=1;
		} else {
			kapiTablabutonkontrol=0;
		}

		// tabla kapı pizzato

		if((kapitablaTip==2)&&((kapiSecimleri==2)||(kapiSecimleri==3))
				&&((kapiTablaAcKonumKat1==1)||(kapiTablaAcKonumKat2==1))
				&&(makineStop==1)) {
			kapiTablapizzato=1;
		} else { /* if((kapitablaTip==1)&&((kapiSecimleri==2)||(kapiSecimleri==3))) */
			kapiTablapizzato=0;
		}

		// kapi Tabla çıkış

		if(kapiTablabutonkontrol==1 || kapiTablaprudhome==1 || kapiTablapizzato==1) {
			HAL_GPIO_WritePin(tablaKapiOut_GPIO_Port, tablaKapiOut_Pin, GPIO_PIN_SET);
		} else {
			HAL_GPIO_WritePin(tablaKapiOut_GPIO_Port, tablaKapiOut_Pin, GPIO_PIN_RESET);
		}

		/********************************* CALİSMA SAYISI KAYIT YERİ *************************************/

		if(((CalismaSayisiYukari==1)&&(HAL_GPIO_ReadPin(ustLimitIn_GPIO_Port, ustLimitIn_Pin)==1)&&(altLimit==0)&&(makineStop==1))
				||((CalismaSayisiAsagi==1)&&((HAL_GPIO_ReadPin(altLimitIn_GPIO_Port, altLimitIn_Pin)==1)&&(altLimit))&&(makineStop==1))) {
			calismaSayisi1=calismaSayisi1+1;
			if(calismaSayisi1>9) {
			  	calismaSayisi1=0;
			  	calismaSayisi10=calismaSayisi10+1;
			}
			if(calismaSayisi10>9) {
			  	calismaSayisi10=0;
			  	calismaSayisi100=calismaSayisi100+1;
			}
			if(calismaSayisi100>9) {
			  	calismaSayisi100=0;
			  	calismaSayisi1000=calismaSayisi1000+1;
			}
			if(calismaSayisi1000>9) {
			  	calismaSayisi1000=0;
			  	calismaSayisi10000=calismaSayisi10000+1;
			}
			eepromData[32]=calismaSayisi10000;
			eepromData[31]=calismaSayisi1000;
			eepromData[30]=calismaSayisi100;
			eepromData[29]=calismaSayisi10;
			eepromData[28]=calismaSayisi1;

			hafizaYaz=1;

			CalismaSayisiYukari=0;
			CalismaSayisiAsagi=0;

		}

		/******************************************* HATA BASLIYOR *******************************************/

		/************************************ ACİL STOP HATA BASLANGICI **************************************************/
		if((HAL_GPIO_ReadPin(yukariStartIn_GPIO_Port, yukariStartIn_Pin)==0
			  	||HAL_GPIO_ReadPin(asagiStartIn_GPIO_Port, asagiStartIn_Pin)==0
			  	||HAL_GPIO_ReadPin(devYukariStartIn_GPIO_Port, devYukariStartIn_Pin)==0
			  	||HAL_GPIO_ReadPin(devAsagiStartIn_GPIO_Port, devAsagiStartIn_Pin)==0)) {
			startBasili=1;
		} else {
			startBasili=0;
		}


		if(startBasili && HAL_GPIO_ReadPin(acilStop1In_GPIO_Port, acilStop1In_Pin)==1) {
			hataVar=1;
			hataKoduLcdGoster(1);
			hata2EEPROM(1);
			acilstophatasi=1;
		} else if(acilstophatasi && HAL_GPIO_ReadPin(acilStop1In_GPIO_Port, acilStop1In_Pin)==0 && startBasili==0) {
			acilstophatasi=0;
			lcdUpdate(1);
		}

		/************************************ Emniyet Çerçevesi Hatasi ***************************************************/

		if(cerceveVar==0 && (HAL_GPIO_ReadPin(asagiStartIn_GPIO_Port, asagiStartIn_Pin)==0 || cercevesasagicalisma)&& (emniyetCercevesi==1)) {
			hataVar=1;
			hataKoduLcdGoster(2);
			hata2EEPROM(2);
			emniyetCercevesihatasi=1;
		} else if(emniyetCercevesihatasi && cerceveVar==1 && asagivalfcalisiyor==0) {
			emniyetCercevesihatasi=0;
			cercevesasagicalisma=0;
			lcdUpdate(2);
		}

		/************************************ BASINC ASIRI YUK HATASI **************************************************/

		if(basincVar==0 && basincSalteri==1 && motorcalisiyor==1 && HAL_GPIO_ReadPin(basincSalteriIn_GPIO_Port, basincSalteriIn_Pin)==1) {
			hataVar=1;
			hataKoduLcdGoster(3);
			hata2EEPROM(3);
			basinchatasi=1;
		} else if(basinchatasi && basincVar==1 && HAL_GPIO_ReadPin(yukariStartIn_GPIO_Port, yukariStartIn_Pin)==1) {
			basinchatasi=0;
			lcdUpdate(3);
		}

		/************************************ KAPI SİVİÇ HATASI **************************************************/
		if((startBasili || HataMakineCalisiyorkapi) && HAL_GPIO_ReadPin(kapiSiviciIn_GPIO_Port, kapiSiviciIn_Pin)==1 && (kapiSecimleri==1 || kapiSecimleri==3)) {
			hataVar=1;
			hataKoduLcdGoster(4);
			hata2EEPROM(4);
			katkapisivicihatasi=1;
		} else if (katkapisivicihatasi && makineStop && startBasili==0 && HAL_GPIO_ReadPin(kapiSiviciIn_GPIO_Port, kapiSiviciIn_Pin)==0) {
			katkapisivicihatasi=0;
			HataMakineCalisiyorkapi=0;
			lcdUpdate(4);
		}

		/************************************ TABLA KAPI SİVİÇ HATASI **************************************************/

		if((startBasili || HataMakineCalisiyortabla)&& HAL_GPIO_ReadPin(tablaKapiSiviciIn_GPIO_Port, tablaKapiSiviciIn_Pin)==1 && (kapiSecimleri==1 || kapiSecimleri==3)) {
			hataVar=1;
			hataKoduLcdGoster(5);
			hata2EEPROM(5);
			tablakapisivicihatasi=1;
		} else if (tablakapisivicihatasi && makineStop && startBasili==0 && HAL_GPIO_ReadPin(tablaKapiSiviciIn_GPIO_Port, tablaKapiSiviciIn_Pin)==0 && makineStop==1) {
			tablakapisivicihatasi=0;
			HataMakineCalisiyortabla=0;
			lcdUpdate(5);
		}

