hidirektor/ondergrup-stm32/v2.0-IoT/Core/Src/main.c
	char* result = malloc(strlen(combinedString) + 1);
	strcpy(result, combinedString);
	return result;
}

void mainLoop() {
	while(1) {
		checkLCDBacklight();

		if((HAL_GPIO_ReadPin(butonIleriIn_GPIO_Port,butonIleriIn_Pin)==0)&&(HAL_GPIO_ReadPin(butonGeriIn_GPIO_Port,butonGeriIn_Pin)==0)&&(HAL_GPIO_ReadPin(butonYukariIn_GPIO_Port,butonYukariIn_Pin)==0)&&(HAL_GPIO_ReadPin(butonAsagiIn_GPIO_Port,butonAsagiIn_Pin)==0)&&(HAL_GPIO_ReadPin(butonEnterIn_GPIO_Port,butonEnterIn_Pin)==0)&&(HAL_GPIO_ReadPin(kapi1AcButonIn_GPIO_Port, kapi1AcButonIn_Pin)==1)&&(HAL_GPIO_ReadPin(kapi2AcButonIn_GPIO_Port, kapi2AcButonIn_Pin)==1)&&(HAL_GPIO_ReadPin(kapiTablaAcButonIn_GPIO_Port, kapiTablaAcButonIn_Pin)==1)) {
			butonKontrol=0;
		} else {
			backLightTimer = millis;
		}

		if(hafizaYaz==1) {
		  while(HAL_I2C_GetError(&hi2c1) == HAL_I2C_ERROR_AF);
		  while (HAL_I2C_GetState(&hi2c1) != HAL_I2C_STATE_READY);

		  HAL_I2C_Mem_Write(&hi2c1,0xA0,0,63,eepromData,63,3000);
		  HAL_Delay(5);

		  hafizaYaz=0;
		  if(dilSecim==0) {
			  lcd_print(2,1,"Data yazildi    ");
		  } else if(dilSecim==1) {
			  lcd_print(2,1,"Data Wrote      ");
		  }

		  HAL_Delay(1000);
		  lcd_clear();
		}

		if((hafizaOku==0)&&(HAL_I2C_GetState(&hi2c1) == HAL_I2C_STATE_READY)) {
		  if(ilkOkuma==0) {
			  lcd_print(1,1,"   **EEPROM**   ");
			  if(dilSecim==0) {
				  lcd_print(2,1,"Data Okunuyor...");
			  } else if(dilSecim==1) {
				  lcd_print(2,1,"Data Reading... ");
			  }
			  HAL_Delay(1000);

			  while(HAL_I2C_GetError(&hi2c1) == HAL_I2C_ERROR_AF);
			  while (HAL_I2C_GetState(&hi2c1) != HAL_I2C_STATE_READY) {
				  HAL_Delay(1000);
			  }

			  if(dilSecim==0) {
				  lcd_print(2,1,"Data Okundu.    ");
			  } else if(dilSecim==1) {
				  lcd_print(2,1,"Data Read.      ");
			  }

			  ilkOkuma=1;
		  } else {
			  if(dilSecim==0) {
				  lcd_print(2,1,"Deger Kaydedildi");
			  } else if(dilSecim==1) {
				  lcd_print(2,1,"Value Saved     ");
			  }
			  lcd_clear();
		  }

		  lcd_clear();

		  eepromKontrol(1);
		  hafizaOku=1;
		}

		if((menuGiris==0)&&(mesajYazildi==0)&&(demoMode==0)) {
			lcd_clear();
			HAL_Delay(10);
			lcd_print(1, 1, "    ESP-RMK     ");
			lcd_print(2, 1, "      RUN       ");
			mesajYazildi=1;
		}

		if ((menuGiris==0) && (HAL_GPIO_ReadPin(butonYukariIn_GPIO_Port,butonYukariIn_Pin)==1) && (HAL_GPIO_ReadPin(butonAsagiIn_GPIO_Port,butonAsagiIn_Pin)==1)) {
			menuGiris=1;
			lcd_clear();
		}

		if(menuGiris==1) {
			menu();
		}

		HAL_GPIO_TogglePin(cycleLed_GPIO_Port, cycleLed_Pin);

		/* GİRİLEN PARAMETRELERE GÖRE AYARLARIN YAPILMASI*/

		if(HAL_GPIO_ReadPin(acilStop1In_GPIO_Port, acilStop1In_Pin)==0 && hataVar==0) {
			stopVar=1;
		} else {
			stopVar=0;
		}

		/****************************************  BASINC SALTERI ********************************************/
		checkBasincSalteri();

		/******** Bas gönder ***********/
		checkBasGonder();

		/******** Kapı Secimleri ***********/
		checkKapiSecimleri();

		/* PARAMETRELERE GÖRE ÇIKISLARIN AYARLANMASI*/
		/*MOTOR CALISIYOR*/
		checkAktifCalisma();

		// DEMO MOD BASLIYOR
		// DEMO YUKARI CALISMA
		checkDemoModCalisma();
	}
}

void printTemplate(int type, int page) {
	if(type == 1 && page == 0) {
		lcd_print(1, 1, "ID: ");
		lcd_print(2, 3, "0");
		lcd_print(2, 4, "1");
		lcd_print(2, 5, "2");
		lcd_print(2, 6, "3");
		lcd_print(2, 7, "4");
		lcd_print(2, 10, "5");
		lcd_print(2, 11, "6");
		lcd_print(2, 12, "7");
		lcd_print(2, 13, "8");
		lcd_print(2, 14, "9");
		lcd_gotoxy(2, 3);
	} else if(type == 2 && page == 1) {
		if(page == 1) {
			lcd_clear();
			HAL_Delay(100);
			lcd_print(1, 1, "SSID: ");
			lcd_print(2, 1, "abcdefghijklmnop");
		} else if(page == 2) {
			lcd_clear();
			HAL_Delay(100);
			lcd_print(1, 1, "SSID: ");
			lcd_print(2, 1, "qrstuvwxyzABCDEF");
		} else if(page == 3) {
			lcd_clear();
			HAL_Delay(100);
			lcd_print(1, 1, "SSID: ");
			lcd_print(2, 1, "GHIJKLMNOPQRSTUV");
		} else if(page == 4) {
			lcd_clear();
			HAL_Delay(100);
			lcd_print(1, 1, "SSID: ");
			lcd_print(2, 1, "WXYZ0123456789!@");
		} else if(page == 5) {
			lcd_clear();
			HAL_Delay(100);
			lcd_print(1, 1, "SSID: ");
			lcd_print(2, 1, "#$%^&*()-_+=<>?");
		}
	}
}

char getCharFromCursorPosition(int cursorPosition, int page) {
	char characters[] = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789!@#$%^&*()-_+=<>?";
    return characters[cursorPosition * page - 1];
}

void takeMachineID() {
	lcd_cursor(1);

    int cursorPosition = 3;
    int machineIDLoc = 0;
    int writeLoc = 5;

    printTemplate(1, 0);

    while (1) {
        if (HAL_GPIO_ReadPin(butonEnterIn_GPIO_Port, butonEnterIn_Pin) == 1) {
        	lcd_cursor(0);

            break;
        }

        if (HAL_GPIO_ReadPin(butonIleriIn_GPIO_Port, butonIleriIn_Pin) == 1) {
        	if(cursorPosition == 7) {
        		cursorPosition = 10;
        	} else if (cursorPosition == 14) {
                cursorPosition = 3;
            } else {
            	cursorPosition++;
            }

        	HAL_Delay(350);
        }

        if (HAL_GPIO_ReadPin(butonGeriIn_GPIO_Port, butonGeriIn_Pin) == 1) {
            if (cursorPosition == 3) {
                cursorPosition = 14;
            } else if(cursorPosition == 10) {
            	cursorPosition = 7;
            } else {
            	cursorPosition--;
            }

            HAL_Delay(350);
        }

        if (HAL_GPIO_ReadPin(butonYukariIn_GPIO_Port, butonYukariIn_Pin) == 1) {
        	if(cursorPosition == 3) {
        		machineID[machineIDLoc] = '0';
        	} else if(cursorPosition == 4) {
        		machineID[machineIDLoc] = '1';
        	} else if(cursorPosition == 5) {
        		machineID[machineIDLoc] = '2';
        	} else if(cursorPosition == 6) {
        		machineID[machineIDLoc] = '3';
        	} else if(cursorPosition == 7) {
        		machineID[machineIDLoc] = '4';
        	} else if(cursorPosition == 10) {
        		machineID[machineIDLoc] = '5';
        	} else if(cursorPosition == 11) {
        		machineID[machineIDLoc] = '6';
        	} else if(cursorPosition == 12) {
        		machineID[machineIDLoc] = '7';
        	} else if(cursorPosition == 13) {
        		machineID[machineIDLoc] = '8';
        	} else if(cursorPosition == 14) {
        		machineID[machineIDLoc] = '9';
        	}

        	lcd_print_char(1, writeLoc, machineID[machineIDLoc]);

