hidirektor/ondergrup-stm32/v2.0-IoT/Core/Src/main.c
        	writeLoc++;
        	machineIDLoc++;

        	HAL_Delay(350);
        }

        lcd_gotoxy(2, cursorPosition);
    }
}

void takeWifiSSID() {
    lcd_cursor(1);

    int cursorPosition = 1;
    int page = 1;
    int wifiNameLoc = 0;
    int writeLoc = 7;

    printTemplate(2, 1);

    while (1) {
        if (HAL_GPIO_ReadPin(butonEnterIn_GPIO_Port, butonEnterIn_Pin) == 1) {
            lcd_cursor(0);
            break;
        }

        if (HAL_GPIO_ReadPin(butonIleriIn_GPIO_Port, butonIleriIn_Pin) == 1) {
            if (cursorPosition == 16) {
            	if(page == 1) {
            		cursorPosition = 1;
            		page++;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "SSID: ");
            		lcd_print(2, 1, "qrstuvwxyzABCDEF");
            	} else if(page == 2) {
            		cursorPosition = 1;
            		page++;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "SSID: ");
            		lcd_print(2, 1, "GHIJKLMNOPQRSTUV");
            	} else if(page == 3) {
            		cursorPosition = 1;
            		page++;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "SSID: ");
            		lcd_print(2, 1, "WXYZ0123456789!@");
            	} else if(page == 4) {
            		cursorPosition = 1;
            		page++;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "SSID: ");
            		lcd_print(2, 1, "#$%^&*()-_+=<>?");
            	}
            } else if(cursorPosition == 15 && page == 5) {
            	cursorPosition = 1;
            	page = 1;
            	lcd_clear();
            	HAL_Delay(100);
            	lcd_print(1, 1, "SSID: ");
            	lcd_print(2, 1, "abcdefghijklmnop");
            } else {
            	cursorPosition++;
            }

            HAL_Delay(350);
        }

        if (HAL_GPIO_ReadPin(butonGeriIn_GPIO_Port, butonGeriIn_Pin) == 1) {
            if(cursorPosition == 1) {
            	if(page == 1) {
            		cursorPosition = 16;
            		page = 5;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "SSID: ");
            		lcd_print(2, 1, "#$%^&*()-_+=<>?");
            	} else if(page == 2) {
            		cursorPosition = 16;
            		page = 1;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "SSID: ");
            		lcd_print(2, 1, "abcdefghijklmnop");
            	} else if(page == 3) {
            		cursorPosition = 16;
            		page = 2;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "SSID: ");
            		lcd_print(2, 1, "qrstuvwxyzABCDEF");
            	} else if(page == 4) {
            		cursorPosition = 16;
            		page = 3;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "SSID: ");
            		lcd_print(2, 1, "GHIJKLMNOPQRSTUV");
            	} else if(page == 5) {
            		cursorPosition = 16;
            		page = 4;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "SSID: ");
            		lcd_print(2, 1, "WXYZ0123456789!@");
            	}
            } else {
            	cursorPosition--;
            }

            HAL_Delay(350);
        }

        if (HAL_GPIO_ReadPin(butonYukariIn_GPIO_Port, butonYukariIn_Pin) == 1) {
            wifiSSID[wifiNameLoc] = getCharFromCursorPosition(cursorPosition, page);

            lcd_print_char(1, writeLoc, wifiSSID[wifiNameLoc]);

            writeLoc++;
            wifiNameLoc++;

            HAL_Delay(250);
        }

        lcd_gotoxy(2, cursorPosition);
    }
}

void takeWifiPass() {
    lcd_cursor(1);

    int cursorPosition = 1;
    int page = 1;
    int wifiPassLoc = 0;
    int writeLoc = 7;

    printTemplate(2, 1);

    while (1) {
        if (HAL_GPIO_ReadPin(butonEnterIn_GPIO_Port, butonEnterIn_Pin) == 1) {
            lcd_cursor(0);
            break;
        }

        if (HAL_GPIO_ReadPin(butonIleriIn_GPIO_Port, butonIleriIn_Pin) == 1) {
            if (cursorPosition == 16) {
            	if(page == 1) {
            		cursorPosition = 1;
            		page++;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "PASS: ");
            		lcd_print(2, 1, "qrstuvwxyzABCDEF");
            	} else if(page == 2) {
            		cursorPosition = 1;
            		page++;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "PASS: ");
            		lcd_print(2, 1, "GHIJKLMNOPQRSTUV");
            	} else if(page == 3) {
            		cursorPosition = 1;
            		page++;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "PASS: ");
            		lcd_print(2, 1, "WXYZ0123456789!@");
            	} else if(page == 4) {
            		cursorPosition = 1;
            		page++;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "PASS: ");
            		lcd_print(2, 1, "#$%^&*()-_+=<>?");
            	}
            } else if(cursorPosition == 15 && page == 5) {
            	cursorPosition = 1;
            	page = 1;
            	lcd_clear();
            	HAL_Delay(100);
            	lcd_print(1, 1, "PASS: ");
            	lcd_print(2, 1, "abcdefghijklmnop");
            } else {
            	cursorPosition++;
            }

            HAL_Delay(350);
        }

        if (HAL_GPIO_ReadPin(butonGeriIn_GPIO_Port, butonGeriIn_Pin) == 1) {
            if(cursorPosition == 1) {
            	if(page == 1) {
            		cursorPosition = 16;
            		page = 5;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "PASS: ");
            		lcd_print(2, 1, "#$%^&*()-_+=<>?");
            	} else if(page == 2) {
            		cursorPosition = 16;
            		page = 1;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "PASS: ");
            		lcd_print(2, 1, "abcdefghijklmnop");
            	} else if(page == 3) {
            		cursorPosition = 16;
            		page = 2;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "PASS: ");
            		lcd_print(2, 1, "qrstuvwxyzABCDEF");
            	} else if(page == 4) {
            		cursorPosition = 16;
            		page = 3;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "PASS: ");
            		lcd_print(2, 1, "GHIJKLMNOPQRSTUV");
            	} else if(page == 5) {
            		cursorPosition = 16;
            		page = 4;
            		lcd_clear();
            		HAL_Delay(100);
            		lcd_print(1, 1, "PASS: ");
            		lcd_print(2, 1, "WXYZ0123456789!@");
            	}
            } else {
            	cursorPosition--;
            }

            HAL_Delay(350);
        }

